# IFCParameter Template Export User Defined Property Sets Property

Source: https://www.revitapidocs.com/2026/45a5015e-7653-31dd-0e07-2ff548c6e05e.htm

---

| IFCParameter Template Export User Defined Property Sets Property |
| --- |

The option to export user\-defined property sets.
 If true, then all user\-defined property sets not excluded will be exported.
 If false, then no user\-defined property sets will be exported.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public bool ExportUserDefinedPropertySets { get; set; }
```

```
Public Property ExportUserDefinedPropertySets As Boolean
	Get
	Set
```

```
public:
property bool ExportUserDefinedPropertySets {
	bool get ();
	void set (bool value);
}
```

```
member ExportUserDefinedPropertySets : bool with get, set
```

#### Property Value

Boolean See Also

#### Reference

IFCParameterTemplate Class Autodesk.Revit.DB Namespace